src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Потерян</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Транзит/Транзит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Транзит</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПокупкаСсылка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/Мегаордера/Мегаордера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мегаордера</name>
  <predefined>
    <items>
      <name>нулевой</name>
    </items>
  </predefined>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочкаПриема</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>типМегаордера</name>
    <type>
      <types>EnumRef.типМегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>Посылка</name>
    <type>
      <types>CatalogRef.Посылки</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>DocumentRef.УпаковатьЗаказы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ТранспортнаяКомпания</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/ВыборЗаказаПолученногоУчастником/Module.bsl
&НаКлиенте
Процедура ПолучитьЗаказы(Команда)
	Отказ = Ложь;
	Если не ЗначениеЗаполнено(Участник) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать ""Участника""",,"Участник");
		Отказ = истина;
	КонецЕсли;	
	Если не ЗначениеЗаполнено(ДатаВыдачи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать ""ДатаВыдачи""",,"ДатаВыдачи");
		Отказ = истина;
	КонецЕсли;	
	Если отказ тогда Возврат КонецЕсли;	
	Если Локально Тогда
		ЗаполнитьЗаказамиВыданнвмиУчастникуЛокально();
	Иначе
		ЗаполнитьЗаказамиВыданнымиУчастникуДанныеСайта();
	КонецЕсли;	
	
	ЗаполнитьПустыеШтрихКоды();
КонецПроцедуры

Процедура ЗаполнитьПустыеШтрихКоды()
	строки_безШК	= Посылки.НайтиСтроки(новый Структура("ШК",Справочники.Мегаордера.ПустаяСсылка()));	
	Для каждого стр из строки_безШК Цикл
		стр.ШК=СП_Штрихкоды.ПолучитьМегаордер(стр.Посылка);
	КонецЦикла;	
КонецПроцедуры	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДниВозврата = Константы.ДниВозврата.Получить();
	Участник = Параметры.Участник;
	Локально = Параметры.Локально;
	Если ЗначениеЗаполнено(Параметры.ДатаВыдачи) Тогда
		ДатаВыдачи = параметры.ДатаВыдачи;
	Иначе
		ДатаВыдачи = ТекущаяДата() - ДниВозврата* 24*60*60;
	КонецЕсли;	
КонецПроцедуры

Процедура ЗаполнитьЗаказамиВыданнымиУчастникуДанныеСайта()
	ВыданныеПокупки_ССайта=СтоСПОбмен_Возвраты.Загрузить_ВыданныеПокупки(Участник, ДатаВыдачи);
	Если ВыданныеПокупки_ССайта.авторизацияВыполнена Тогда
		тз =  ВыданныеПокупки_ССайта.результат;
		тз.Сортировать("ДатаВыдачи Убыв");
		
		Для Каждого элем из тз Цикл
			новаяСтрока	= Посылки.Добавить();
			новаяСтрока.Посылка 	= элем.Покупка;
			новаяСтрока.Организатор = элем.Покупка.Организатор;
			новаяСтрока.ДатаВыдачи 	= элем.ДатаВыдачи;
			новаяСтрока.ПунктВыдачи = элем.ПунктВыдачи;
			
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры	

Процедура ЗаполнитьЗаказамиВыданнвмиУчастникуЛокально()	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОбороты.Покупка КАК Посылка,
		|	ОстаткиТоваровОбороты.Период КАК ДатаВыдачи
		|ПОМЕСТИТЬ втСбор
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Участник = &Участник) КАК
		|		ОстаткиТоваровОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТранзитОбороты.ПокупкаСсылка,
		|	ТранзитОбороты.Период
		|ИЗ
		|	РегистрНакопления.Транзит.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Участник = &Участник) КАК ТранзитОбороты
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСбор.Посылка КАК Посылка,
		|	втСбор.Посылка.Организатор КАК Организатор,
		|	МАКСИМУМ(втСбор.ДатаВыдачи) КАК ДатаВыдачи,
		|	втСбор.Посылка.ПунктВыдачи КАК ПунктВыдачи
		|ИЗ
		|	втСбор КАК втСбор
		|СГРУППИРОВАТЬ ПО
		|	втСбор.Посылка,
		|	втСбор.Посылка.Организатор,
		|	втСбор.Посылка.ПунктВыдачи
		|УПОРЯДОЧИТЬ ПО
		|	МАКСИМУМ(втСбор.ДатаВыдачи) УБЫВ";

	Запрос.УстановитьПараметр("Участник", 		Участник);
    Запрос.УстановитьПараметр("ДатаНачала", 	ДатаВыдачи);                                       
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

    Посылки.Загрузить(Результат.Выгрузить());
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	Если элементы.посылки.ТекущиеДанные = неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать посылку!");
		Возврат;
	КонецЕсли;	
	
	Закрыть(Элементы.Посылки.ТекущиеДанные.ШК);
	//Закрыть(Новый Структура("Посылка, Организатор, ШК",Элементы.Посылки.ТекущиеДанные.Посылка, Элементы.Посылки.ТекущиеДанные.Организатор, Элементы.Посылки.ТекущиеДанные.ШК));
КонецПроцедуры
